In [27]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import BernoulliNB
from sklearn.metrics import accuracy_score,confusion_matrix, plot_confusion_matrix
%matplotlib

Using matplotlib backend: agg

In [2]:
titanic = pd.read_csv('https://raw.githubusercontent.com/LetsUpgrade/AI-ML-July-2020/master/Day-24/Dataset/train.csv')

In [3]:
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [4]:
titanic.shape

(889, 12)

In [5]:
titanic.describe

<bound method NDFrame.describe of      PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
884          887         0       2  ...  13.0000   NaN         S
885          888         1       1  ...  30.0000   B42         S
886          889         0       3  ...  23.4500   NaN         S
887          890         1       1  ...  30.0000  C148         C
888          891         0       3  ...   7.7500   NaN         Q

[889 rows x 12 columns]>

In [6]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Label Encoder

In [8]:
le = LabelEncoder()
titanic['Sex'] = le.fit_transform(titanic['Sex'])
titanic['Embarked'] = le.fit_transform(titanic['Embarked'])

In [9]:
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    NaN         2
1            2         1       1  ...  71.2833    C85         0
2            3         1       3  ...   7.9250    NaN         2
3            4         1       1  ...  53.1000   C123         2
4            5         0       3  ...   8.0500    NaN         2

[5 rows x 12 columns]

In [10]:
titanic.dropna(inplace=True)
titanic.drop_duplicates(inplace=True)

Bernoulli Naive Bayes

In [15]:
model = BernoulliNB()

In [13]:
x = titanic[[ 'Pclass',  'Sex', 'Age', 'SibSp',
       'Parch', 'Fare',  'Embarked']]
y = titanic['Survived']

Spliting data to Training and Testing

In [14]:
X_train, X_test, y_train, y_test=train_test_split(x, y,test_size=0.2, random_state=123)

In [16]:
model.fit(X_train, y_train)

BernoulliNB(alpha=1.0, binarize=0.0, class_prior=None, fit_prior=True)

In [21]:
print('Model Score ',model.score(X_train,y_train))

Model Score  0.7639751552795031

In [18]:
pred = model.predict(X_test)

In [20]:
print('Accuracy Score ',accuracy_score(y_test, pred))

Accuracy Score  0.7317073170731707

In [22]:
 print('Confusion Matrix: ', confusion_matrix(y_test, pred))

Confusion Matrix:  [[ 9  4]
 [ 7 21]]

In [30]:
plot_confusion_matrix(model, X_test, y_test)
plt.show()